# Built In Failures Numbering Failures Input Out Of Valid Range Error Property

Source: https://www.revitapidocs.com/2026/d5ecbf6f-c665-ef5a-11ce-0fd5a5b4a5d1.htm

---

| Built In Failures Numbering Failures Input Out Of Valid Range Error Property |
| --- |

The input value is out of the allowed range.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static FailureDefinitionId InputOutOfValidRangeError { get; }
```

```
Public Shared ReadOnly Property InputOutOfValidRangeError As FailureDefinitionId
	Get
```

```
public:
static property FailureDefinitionId^ InputOutOfValidRangeError {
	FailureDefinitionId^ get ();
}
```

```
static member InputOutOfValidRangeError : FailureDefinitionId with get
```

#### Property Value

FailureDefinitionId See Also

#### Reference

BuiltInFailures NumberingFailures Class Autodesk.Revit.DB Namespace